testEdo/Labs/Lab04-HeatTransfer/combustor2D-RPF-lowRe-highT/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-05;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
	    $p;
	    relTol	0;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    
    "rho.*"
    {
		solver		smoothSolver;
		smoother	symGaussSeidel;
		tolerance	1e-5;
		relTol		0;
    }
    
    h
    {
	    solver	smoothSolver;
	    smoother	symGaussSeidel;
	    tolerance	1e-5;
	    relTol	0;
    }
    
    hFinal
    {
	    $h;
	    relTol	0;
    }
}

PIMPLE
{
	nCorrectors		1;
	nOuterCorrectors	100; 
	turbOnFinalIterOnly	no;
	nNonOrthogonalCorrectors	0;
	consistent		no;

	outerCorrectorResidualControl
	{
		"(U|k|epsilon|p|rho|h)"
		{
			relTol	0;
			tolerance	1e-4;
		}
	}
}

relaxationFactors
{
	fields
	{
		"p.*"	0.5;
	}

	equations
       	{
        	"U.*"               	0.75;
       	"(k|epsilon).*"        0.65;
		"(h|e).*"         	0.65;
   
    	}
}


// ************************************************************************* //
